In [1]:
# Pandas:

# series

import pandas as pd
import numpy as np

In [9]:
labels = ['a', 'b', 'c']

my_data = [10,20,30]

arr = np.array(my_data)



d = {'a' : 10, 'b': 20, 'c':30}
d1 = dict(a = 10, b = 20, c = 30) 
 
print(arr)
print(my_data)

type(d)
type(d1)

[10 20 30]
[10, 20, 30]

dict

In [6]:

pd.Series(data = my_data)

#pd.Series(data = my_data, index= labels)

0    10
1    20
2    30
dtype: int64

In [10]:
pd.Series(arr, labels) # it took the labels as the index.

# pandas series can take a different variety of data types.

ser1 = pd.Series([1,2,3,4], ["USA", "Germany", "USSR", "Japan"])
print(ser1)
ser2 = pd.Series([1,2,5,4], ["USA", "Germany", "Italy", "Japan"])

# To take the number out of it:
print(ser1["USA"])

# See, what will happen when we add two series:
ser1 + ser2

#ser3 = pd.Series(["USA", "Germany", "USSR", "Japan"], [1,2,3,4])
#ser4 = pd.Series(["USA", "Germany", "Italy", "Japan"], [1,2,5,4])

#ser3 + ser4

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64
1

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

# Data Frames

In [2]:
np.random.seed(101)

df = pd.DataFrame(np.random.rand(5,4), ["A", "B", "C", "D", "E"],["W", "X", "Y", "Z"])

print(df)

# # its like, W X Y Z are series with a common index.

          W         X         Y         Z
A  0.516399  0.570668  0.028474  0.171522
B  0.685277  0.833897  0.306966  0.893613
C  0.721544  0.189939  0.554228  0.352132
D  0.181892  0.785602  0.965483  0.232354
E  0.083561  0.603548  0.728993  0.276239

In [5]:
df["W"]

# df["A"] wont work

# I am at 5:20

A    0.516399
B    0.685277
C    0.721544
D    0.181892
E    0.083561
Name: W, dtype: float64

In [6]:
# Making a new column:

df['new_col'] = df['W'] + df['X']

print(df)

# Removing a column:

df = df.drop("new_col", axis= 1) # We need to mention the axis = 1, if we are giving the name of col
# as by default it takes axis = 0, which refers to index or the rows name

print(df)

df = df.drop('A')

print(df)

          W         X         Y         Z   new_col
A  0.516399  0.570668  0.028474  0.171522  1.087066
B  0.685277  0.833897  0.306966  0.893613  1.519174
C  0.721544  0.189939  0.554228  0.352132  0.911483
D  0.181892  0.785602  0.965483  0.232354  0.967494
E  0.083561  0.603548  0.728993  0.276239  0.687110
          W         X         Y         Z
A  0.516399  0.570668  0.028474  0.171522
B  0.685277  0.833897  0.306966  0.893613
C  0.721544  0.189939  0.554228  0.352132
D  0.181892  0.785602  0.965483  0.232354
E  0.083561  0.603548  0.728993  0.276239
          W         X         Y         Z
B  0.685277  0.833897  0.306966  0.893613
C  0.721544  0.189939  0.554228  0.352132
D  0.181892  0.785602  0.965483  0.232354
E  0.083561  0.603548  0.728993  0.276239

In [7]:
# if we do just 
df.drop('B') # the original df willnot get updated.

# we either need to do this:
#df = df.drop('A')

# OR

df.drop('B', inplace= True)

print(df)

          W         X         Y         Z
C  0.721544  0.189939  0.554228  0.352132
D  0.181892  0.785602  0.965483  0.232354
E  0.083561  0.603548  0.728993  0.276239

In [19]:
# selecting rows and columns:

# Selecting Columns:

print(df)

print(df[["W", "X"]])

# selecting rows:

print(df.loc['C']) # Will retun a series.

# WE can even feed in the index based location.
df.iloc[1]

          W         X         Y         Z
A  0.516399  0.570668  0.028474  0.171522
B  0.685277  0.833897  0.306966  0.893613
C  0.721544  0.189939  0.554228  0.352132
D  0.181892  0.785602  0.965483  0.232354
E  0.083561  0.603548  0.728993  0.276239
          W         X
A  0.516399  0.570668
B  0.685277  0.833897
C  0.721544  0.189939
D  0.181892  0.785602
E  0.083561  0.603548
W    0.721544
X    0.189939
Y    0.554228
Z    0.352132
Name: C, dtype: float64

W    0.685277
X    0.833897
Y    0.306966
Z    0.893613
Name: B, dtype: float64

In [11]:
# We can get a value by feeding:

df.loc["C", "W"]

# We can ven subset the df by passing the rows and the col names in a list

0.7215438617683047

In [17]:
# Subsetting in a dataframe.

print(df)
df["W"] > 0.1

df[df["W"] > 0.1] # This will only return the rows which fulfill the condition.

          W         X         Y         Z
C  0.721544  0.189939  0.554228  0.352132
D  0.181892  0.785602  0.965483  0.232354
E  0.083561  0.603548  0.728993  0.276239

          W         X         Y         Z
C  0.721544  0.189939  0.554228  0.352132
D  0.181892  0.785602  0.965483  0.232354

In [22]:
# To apply multiple conditions:

print(df)
df[(df["W"]> 0.1) & (df["X"] > 0.1)]


# Keep in mind not to use the and operator here.. use & operator.

df[(df["W"]> 0.1) | (df["X"] > 0.1)]  # This being the or operator.

          W         X         Y         Z
C  0.721544  0.189939  0.554228  0.352132
D  0.181892  0.785602  0.965483  0.232354
E  0.083561  0.603548  0.728993  0.276239

          W         X         Y         Z
C  0.721544  0.189939  0.554228  0.352132
D  0.181892  0.785602  0.965483  0.232354
E  0.083561  0.603548  0.728993  0.276239

In [30]:
# Something of importance:

# re-setting the index:


df.reset_index() # our old index will shift into a column

# again:

#df.reset_index(inplace = True)

  index         W         X         Y         Z
0     A  0.516399  0.570668  0.028474  0.171522
1     B  0.685277  0.833897  0.306966  0.893613
2     C  0.721544  0.189939  0.554228  0.352132
3     D  0.181892  0.785602  0.965483  0.232354
4     E  0.083561  0.603548  0.728993  0.276239

In [32]:
print(df)

          W         X         Y         Z
A  0.516399  0.570668  0.028474  0.171522
B  0.685277  0.833897  0.306966  0.893613
C  0.721544  0.189939  0.554228  0.352132
D  0.181892  0.785602  0.965483  0.232354
E  0.083561  0.603548  0.728993  0.276239

In [4]:
# Lets make a new column:

newind = 'CA NY WY OR CO'.split()

df['states'] = newind

print(df)

# Now I want this states col as my new index:

df.set_index('states')

# Keep in mind, this will overwrite the existing index.

          W         X         Y         Z states
A  0.516399  0.570668  0.028474  0.171522     CA
B  0.685277  0.833897  0.306966  0.893613     NY
C  0.721544  0.189939  0.554228  0.352132     WY
D  0.181892  0.785602  0.965483  0.232354     OR
E  0.083561  0.603548  0.728993  0.276239     CO

               W         X         Y         Z
states
CA      0.516399  0.570668  0.028474  0.171522
NY      0.685277  0.833897  0.306966  0.893613
WY      0.721544  0.189939  0.554228  0.352132
OR      0.181892  0.785602  0.965483  0.232354
CO      0.083561  0.603548  0.728993  0.276239

Data frames part 3 - Multi indexing

In [5]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside)) # Making a list of tuples.
hier_index = pd.MultiIndex.from_tuples(hier_index)

print(hier_index)

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [5]:
import numpy as np
import pandas as pd

In [8]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1 -0.100264  0.996175
   2 -0.802666  0.015403
   3 -0.814152  0.979984
G2 1 -0.083274 -0.213177
   2 -0.837240  1.800221
   3  0.573780 -1.302686

In [10]:
# the code above is not that important, it is just used to make a multi index data frame.


# to call data from a multilevel index data frame:


df.loc["G1"].loc[1]

A   -0.100264
B    0.996175
Name: 1, dtype: float64

In [13]:
# We can label our index like:

df.index.names = ["Groups", "Num"]

print(df)

                   A         B
Groups Num
G1     1   -0.100264  0.996175
       2   -0.802666  0.015403
       3   -0.814152  0.979984
G2     1   -0.083274 -0.213177
       2   -0.837240  1.800221
       3    0.573780 -1.302686

In [17]:
# the cross section function:
# Using when have a milti level index: Useful when we want to go deep in the index, 
# for example, I want all the numbers with the num index to be 1, irrespective of the groups index.

df.xs(1, level = 'Num')

df.xs('G1', level='Groups')

            A         B
Num
1   -0.100264  0.996175
2   -0.802666  0.015403
3   -0.814152  0.979984

# Missing Data

In [19]:
# Dealing with misin data - dropping or filling the missing value.

In [6]:
d = {"A" : [1,2,np.nan], "B" : [5,np.nan, np.nan], "C" : [1,2,3]}

df = pd.DataFrame(d)

df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [24]:
# the drop na method:
df.dropna(axis = 0) # It will drop any row with a NA value in it.
# I can guve it axis = 1, it will drop a column with NA in it,

# We can even feed in a threshold = number of non-NA value below which it will drop that row.

     A    B  C
0  1.0  5.0  1

Fill NA method:

In [31]:
df.fillna(value = "FILL IT") # It will fill in the thing we feed to it. Like in this case, it will fill "FILL IT" in the place of NaN

# We can feed in the mean of the column:

df["A"].fillna(value = df["A"].mean(), inplace= True)

print(df)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  1.5  NaN  3

THE groupby Method:

In [1]:
# This method allows to group together rows based off of a column and perform an aggregate function on them:
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}


df = pd.DataFrame(data)
print(df)

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [2]:
df.groupby('Company').mean()

#byComp = df.groupby('Company')

#byComp.mean() # It automatically didn't take mean of the Person column. - it is ignoring the non numeric column.

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [9]:
# So, the one liner would be:

df.groupby("Company").sum().loc["FB"]

# will give us sum of the sale of the the people in FB.

Sales    593
Name: FB, dtype: int64

In [11]:
# We also have one count feature:
df.groupby("Company").count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [14]:
# we can get a buntch of information using the describe method:

df.groupby("Company").describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

Merging, Joining, Concatenating Data Frames:

In [15]:
# Combine data frames:

######### Look at the notes Downloaded #########

Operations:

In [20]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,545,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   545  ghi
3     4   444  xyz

In [21]:
# Finding unique values in a data frame:

print(df["col2"].unique())

# we can see the number of unique values by simply:

len(df["col2"].unique())

# OR 

df["col2"].nunique()

# We can even get, how many times each unique value appears:

print(df["col2"].value_counts()) # Tells how many times each value appears

print(df["col2"].count()) # tells how many values are there in the column

[444 555 545]
444    2
555    1
545    1
Name: col2, dtype: int64
4

In [22]:
# Applying a costom function to a col in data frame:

def times2(x):
    return x*2

print(df["col1"].apply(times2))

# Suppose we want the length of the str in the col:

print(df['col3'].apply(len))

0    2
1    4
2    6
3    8
Name: col1, dtype: int64
0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [29]:
# Sorting and ordering a data frame:
df.sort_values(by= "col2")

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [31]:
# finding the null values in df:

df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [23]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [35]:
# Making a pivot table:

df.pivot_table(values= 'D', index = ['A', 'B'], columns= ['C'])

# Its a fancy way to reorganise the table we already have:

# it made a multi level index out of A and B. Values under focus are of D. We made 2 seperate column out of the column C.

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [24]:
import sqlalchemy as sq
import lxml as lx
import html5lib as ht

Data Input and Output

In [47]:
pd.read_csv("example.csv")

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [48]:
os.getcwd()

'e:\\Training\\Udemy\\Python DataScience\\PythonDataScience\\Python DS'

In [51]:
# to wrie a file:

df.to_csv('My_output', index  = False) # index as False to prevent it from making a seperate column for the index name

In [9]:
# reading an excel file:
pd.read_excel('Excel_Sample.xlsx', sheet_name = "Sheet1", index_col= 0) # I mentioned the index col to be the first column.

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [10]:

# To write an excel file:


df.to_excel("Excel_sample2.xlsx", sheet_name= ' NewSheet')

In [4]:
# working with HTML files:
# I have a fancy link:

df = pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/')

In [10]:
df

[                         Bank NameBank           CityCity StateSt  CertCert  \
 0                    Almena State Bank             Almena      KS     15426
 1           First City Bank of Florida  Fort Walton Beach      FL     16748
 2                 The First State Bank      Barboursville      WV     14361
 3                   Ericson State Bank            Ericson      NE     18265
 4     City National Bank of New Jersey             Newark      NJ     21111
 ..                                 ...                ...     ...       ...
 558                 Superior Bank, FSB           Hinsdale      IL     32646
 559                Malta National Bank              Malta      OH      6629
 560    First Alliance Bank & Trust Co.         Manchester      NH     34264
 561  National State Bank of Metropolis         Metropolis      IL      3815
 562                   Bank of Honolulu           Honolulu      HI     21029

                  Acquiring InstitutionAI Closing DateClosing  FundFund
 0                            Equity Bank    October 23, 2020     10538
 1              United Fidelity Bank, fsb    October 16, 2020     10537
 2                         MVB Bank, Inc.       April 3, 2020     10536
 3             Farmers and Merchants Bank   February 14, 2020     10535
 4                        Industrial Bank    November 1, 2019     10534
 ..                                   ...                 ...       ...
 558                Superior Federal, FSB       July 27, 2001      6004
 559                    North Valley Bank         May 3, 2001      4648
 560  Southern New Hampshire Bank & Trust    February 2, 2001      4647
 561              Banterra Bank of Marion   December 14, 2000      4646
 562                   Bank of the Orient    October 13, 2000      4645

 [563 rows x 7 columns]]

In [ ]:
# We can work with SQL file also, do refer notebook to explore that